<h2> Python Basics

I. Cobalah print kalimat "Hello, my name is ***nama anda***" dengan minimal 2 cara: <br>
a.   Print biasa (nama diletakkan langsung dalam string yang di print)<br>
b.  Menggunakan variabel (nama disimpan dulu di variabel)<br>
c.  Menggunakan operator dan variabel<br>
d.  Menggunakan .format()

In [2]:
nama = "Marvel"
# 1 
print("Hello, my name is Marvel")
# 2 
print("Hello, my name is", nama)
# 3 
print("Hello, my name is " + nama)
# 4 
print("Hello, my name is {}".format(nama))

Hello, my name is Marvel
Hello, my name is Marvel
Hello, my name is Marvel
Hello, my name is Marvel

II. Selesaikan soal cerita berikut menggunakan python:<br>
a.  Jose membeli 4 kotak kelereng, tiap kotak berisi 15 buah kelereng. Kelereng itu akan dibagikan kepada 12 orang temannya, setiap teman akan mendapat ... kelereng.<br>
b.  Hasil dari 8 pangkat 1/3 adalah ...<br>
c.  Eillen memiliki uang sebesar Rp 50.000 untuk dibelanjakan kertas binder, 1 paket kertas binder isi 100 lembar dijual seharga 7500, jika ia ingin membeli berapa kertas binder yang dapat ia beli dengan uang yang ia punya? Berapa kembalian yang diterima?

In [10]:
# a
kotak = 4
isi = 15 
teman = 12

total = kotak * isi
dapat = total / teman
print(f"a. Setiap teman akan mendapatkan {dapat} kelereng.")

#b 
hasil = 8 ** (1/3)
print(f"b. {hasil}")

#c
uang = 50000
hargapaket = 7500
jumlahpaket = uang // hargapaket
kembalian = uang % hargapaket
totallembar = jumlahpaket * 100

print(f"c. Eillen dapat membeli {jumlahpaket} paket kertas binder atau {totallembar} lembar.")
print(f"Kembalian yang diterima adalah Rp {kembalian}.")

a. Setiap teman akan mendapatkan 5.0 kelereng.
b. 2.0
c. Eillen dapat membeli 6 paket kertas binder atau 600 lembar.
Kembalian yang diterima adalah Rp 5000.

III. Tunjukan cara untuk mengonversi tipe-tipe data berikut:

1. "1000" -> 1000 (string ke int)
2. 5.25 -> 5 (float ke int)
3. 5 -> 5.0 (int ke float)
4. 1000 -> "1000" (int ke string)

Expected output:


![image.png]()

In [11]:
# 1
string_ke_int = int("1000")
print(string_ke_int, type(string_ke_int))

# 2
float_ke_int = int(5.25)
print(float_ke_int, type(float_ke_int))

# 3
int_ke_float = float(5)
print(int_ke_float, type(int_ke_float))

# 4
int_ke_string = str(1000)
print(int_ke_string, type(int_ke_string))

1000 <class 'int'>
5 <class 'int'>
5.0 <class 'float'>
1000 <class 'str'>

IV. String

"If you want to know what a man's like, take a good look at how he treats his inferiors, not his equals."

1. Tampilkan indeks ke 20 sampai 30 dari string di atas (indeks ke 30 ikut)
2. Bagaimana cara memisah string berdasarkan spasi (simpan dalam list)
3. Balik string di atas dengan menggunakan satu baris kode (menggunakan index)

In [13]:
# Definisikan string
quote = "If you want to know what a man's like, take a good look at how he treats his inferiors, not his equals."

# 1
substring = quote[20:31]
print(substring)

# 2
split_string = quote.split(" ")
print(split_string)

# 3
reversed_string = quote[::-1]
print(reversed_string)

what a man'
['If', 'you', 'want', 'to', 'know', 'what', 'a', "man's", 'like,', 'take', 'a', 'good', 'look', 'at', 'how', 'he', 'treats', 'his', 'inferiors,', 'not', 'his', 'equals.']
.slauqe sih ton ,sroirefni sih staert eh woh ta kool doog a ekat ,ekil s'nam a tahw wonk ot tnaw uoy fI

<h2> Python Data Strcutures

I. Tuple


1.   Buatlah sebuah tuple yang berisikan nama prodi di UC, simpan dalam variabel "Prodi".
2.   Cetaklah panjang tuple yang dibuat.
3.   Gunakan .index() untuk mengetahui posisi/index prodi ISB

In [14]:
# 1
Prodi = ("ISB", "IBM", "VCD", "MED", "IMT", "PSY", "BMI", "FTP")

# 2
print("Panjang tuple:", len(Prodi))

# 3
index_isb = Prodi.index("ISB")
print("Index prodi ISB:", index_isb)

Panjang tuple: 8
Index prodi ISB: 0

II. List


1.   Buatlah sebuah list berisi 3 nama makanan kesukaanmu. Simpan dalam variabel "favorit".
2.   Cetak nama setiap makanan dengan mengakses setiap elemen dalam list satu persatu.
3. Kamu sedang berada di sebuah restoran dan hendak memesan salah satu menu yang ada dalam daftar favoritmu. Cetak setiap makanan dengan contoh: "Aku ingin pesan {nama makanan}"
4.   Ternyata, salah satu menu tidak tersedia, jadi kamu perlu memesan makanan lain. Ganti makanan yang kosong dengan nama makanan baru (makanan yang mana bebas)

In [23]:
# 1
favorit = ["Pizza", "Sate Ayam", "Indomie"]

# 2
for elemen in favorit:
    print(elemen)
      
# 3
for makanan in favorit:
    print(f"Aku ingin pesan {makanan}")

# 4
favorit[1] = "Rendang"

# Cetak ulang
print("\nMenu setelah diganti:")
for makanan in favorit:
    print(f"Aku ingin pesan {makanan}")

Pizza
Sate Ayam
Indomie
Aku ingin pesan Pizza
Aku ingin pesan Sate Ayam
Aku ingin pesan Indomie

Menu setelah diganti:
Aku ingin pesan Pizza
Aku ingin pesan Rendang
Aku ingin pesan Indomie

III. Set

1. Buatlah 4 buah set sebagai berikut


    set1 = {1, 2, 3, 4}
    set2 = {2, 4, 6, 8}
    set3 = {5, 7}
    set4 = {2, 3}
2. Gabungkan set1 dan set2 dengan menghilangkan duplicates
3. Buktikan set1 dan set3 tidak mempunyai intersection (output : Boolean)
4. Buktikan set4 adalah bagian dari set1 (output : Boolean)

In [25]:
# Membuat 4 buah set
set1 = {1, 2, 3, 4}
set2 = {2, 4, 6, 8}
set3 = {5, 7}
set4 = {2, 3}

# Menggabungkan set1 dan set2 dengan menghilangkan duplicates (union)
gabungan = set1.union(set2)
print(gabungan)

# Membuktikan set1 dan set3 tidak mempunyai intersection
no_intersection = set1.isdisjoint(set3)
print(no_intersection)

# Membuktikan set4 adalah bagian dari set1 (subset)
is_subset = set4.issubset(set1)
print(is_subset)

{1, 2, 3, 4, 6, 8}
True
True

<h2> Python Programming Fundamentals

I. Buatlah sebuah program sederhana yang meminta inputan dari user berupa jumlah penggunaan listrik dan menghasilkan output berupa tarif yang harus dibayar dengan syarat sebagai berikut:

PLN menerapkan pembayaran listrik perumahan dengan perhitungan sebagai berikut:
* untuk golongan 1 (penggunaan <1000 kWh) tarif : Rp1000/kWh
* untuk golongan 2 (penggunaan >= 1000 kWh) tarif : Rp2000/kWh

Dengan syarat perhitungan:

Minimum pembayaran adalah 100 kWh sedangkan untuk pemakaian 1000 kWh dan seterusnya tarifnya ditambah 10% dari total pembayaran.

(Jika total penggunaan <100 kWh, maka akan dikenakan tarif 100 kWh)

In [26]:
# Meminta input dari user berupa jumlah penggunaan listrik
penggunaan = int(input("Masukkan jumlah penggunaan listrik (dalam kWh): "))

# Menentukan tarif minimum
if penggunaan < 100:
    penggunaan = 100  # Jika penggunaan kurang dari 100 kWh, dikenakan tarif 100 kWh

# Menghitung tarif berdasarkan golongan
if penggunaan < 1000:
    tarif = penggunaan * 1000  # Tarif golongan 1
else:
    tarif = penggunaan * 2000  # Tarif golongan 2
    tarif += 0.1 * tarif       # Menambahkan 10% dari total pembayaran untuk golongan 2

# Menampilkan hasil perhitungan
print(f"Tarif yang harus dibayar: Rp{tarif}")

Masukkan jumlah penggunaan listrik (dalam kWh): 1500
Tarif yang harus dibayar: Rp3300000.0

II. Untuk Abdimas Oweek UC digunakan angkot dengan kapasitas 10 orang per angkot. Apabila terjadi kelebihan penumpang (walau hanya 1 orang), angkot yang digunakan ditambah 1. Tulislah program untuk menghitung jumlah angkot yang diperlukan bila jumlah pesertanya menggunakan input().

Catatan, pastikan jika angka yang dimasukkan negatif, muncul peringatan "Jumlah orang tidak bisa negatif!"

In [27]:
# Meminta input dari user berupa jumlah peserta
peserta = int(input("Masukkan jumlah peserta: "))

# Memeriksa jika jumlah peserta negatif
if peserta < 0:
    print("Jumlah orang tidak bisa negatif!")
else:
    # Menghitung jumlah angkot yang diperlukan
    kapasitas_angkot = 10
    angkot_diperlukan = (peserta + kapasitas_angkot - 1) // kapasitas_angkot  # Pembulatan ke atas

    # Menampilkan hasil
    print(f"Jumlah angkot yang diperlukan: {angkot_diperlukan}")

Masukkan jumlah peserta: 101
Jumlah angkot yang diperlukan: 11

<h2> Numpy

1. Buatlah 1D numpy array berisi nama nama hari dalam satu minggu
2. Gunakan sort untuk mengurutkan array sesuai abjad
3. Gunakan rand untuk mengambil 1 hari dari array, cetakhlah dalam format: "Selamat hari \<nama hari\> adalah hari baikmu bulan ini!"
4. Buatlah matriks 3x4 menggunakan numpy array berisi angka 1-6, lalu cetak shape dan dimensi array
5. Cetaklah elemen kolom ketiga dari matrix

    [[1 ,2, 3, 4],

    [5, 6, 7, 8],

    [9, 10, 11, 12]]
6. Gunakan reshape untuk mengubah matrix di atas menjadi matriks berukuran (2, 6)

In [30]:
import numpy as np

# 1
hari = np.array(["Senin", "Selasa", "Rabu", "Kamis", "Jumat", "Sabtu", "Minggu"])
print(hari)

['Senin' 'Selasa' 'Rabu' 'Kamis' 'Jumat' 'Sabtu' 'Minggu']

In [32]:
# 2
hari_sorted = np.sort(hari)
print(hari_sorted)

['Jumat' 'Kamis' 'Minggu' 'Rabu' 'Sabtu' 'Selasa' 'Senin']

In [34]:
import random
# 3
random_hari = np.random.choice(hari)
print(f"Selamat hari {random_hari} adalah hari baikmu bulan ini!")

Selamat hari Rabu adalah hari baikmu bulan ini!

In [35]:
# 4
matrix = np.array([[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12]])
print("\nMatrix:")
print(matrix)
print("Shape dari matrix:", matrix.shape)
print("Dimensi dari matrix:", matrix.ndim)

Matrix:
[[ 1  2  3  4]
 [ 5  6  7  8]
 [ 9 10 11 12]]
Shape dari matrix: (3, 4)
Dimensi dari matrix: 2

In [36]:
# 5
print(matrix[:, 2])

Elemen kolom ketiga dari matrix: [ 3  7 11]

In [37]:
# 6
reshaped_matrix = matrix.reshape(2, 6)
print("\nMatrix setelah di-reshape menjadi (2, 6):")
print(reshaped_matrix)

Matrix setelah di-reshape menjadi (2, 6):
[[ 1  2  3  4  5  6]
 [ 7  8  9 10 11 12]]

<h2> Pandas

1. Buatlah Pandas Series dari list ["Information", "Systems", "for", "Business"]
2. Buatlah Pandas Dataframe dari dictionary
{ "brand": "Ford", "model": "Mustang", "year": 1964 }

In [41]:
import pandas as pd

# 1
list_data = ["Information", "Systems", "for", "Business"]
series = pd.Series(list_data)
print("Pandas Series:")
print(series)

# 2
data_dict = {
    "brand": ["Ford"],
    "model": ["Mustang"],
    "year": [1964]
}
dataframe = pd.DataFrame(data_dict)
print("\nPandas DataFrame:")
print(dataframe)

Pandas Series:
0    Information
1        Systems
2            for
3       Business
dtype: object

Pandas DataFrame:
  brand    model  year
0  Ford  Mustang  1964

3. Import dataset berikut kedalam dataframe.    
dataset : https://raw.githubusercontent.com/michellechandraa/TutorDataMining/main/50_Startups.csv
4. Tunjukan kota apa saja yang ada dalam dataset tersebut
5. Buatlah dataset baru yang menyimpan 10 row random dari dataset. Kemudian tunjukanlah 5 row pertamanya.
6. Gunakan df.info() untuk melihat informasi singkat dari dataframe
7. Tampilkan data 'R&D Spend' dan 'Marketing Spend' dari data yang berasal dari kota 'California'
8. Temukan apa ada missing value dari setiap kolom
9. Drop data yang memiliki profit di bawah 50000
10. Urutkan Dataframe berdasarkan biaya marketing mulai dari terbesar ke terkecil

In [62]:
# 3
url = "https://raw.githubusercontent.com/michellechandraa/TutorDataMining/main/50_Startups.csv"
df = pd.read_csv(url)
df.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [63]:
# 4
kota = df['State'].unique()
print(kota)

['New York' 'California' 'Florida']

In [64]:
# 5
df_random = df.sample(n=10)
df_random.head()

    R&D Spend  Administration  Marketing Spend       State     Profit
7   130298.13       145530.06        323876.68     Florida  155752.60
30   61994.48       115641.28         91131.24     Florida   99937.59
21   78389.47       153773.43        299737.29    New York  111313.02
13   91992.39       135495.07        252664.93  California  134307.35
4   142107.34        91391.77        366168.42     Florida  166187.94

In [65]:
# 6
print("\nInformasi singkat dari dataframe:")
print(df.info())

Informasi singkat dari dataframe:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   R&D Spend        50 non-null     float64
 1   Administration   50 non-null     float64
 2   Marketing Spend  50 non-null     float64
 3   State            50 non-null     object
 4   Profit           50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB
None

In [66]:
# 7
california_data = df[df['State'] == 'California'][['R&D Spend', 'Marketing Spend']]
print(california_data)

    R&D Spend  Marketing Spend
1   162597.70        443898.53
6   134615.46        127716.82
9   123334.88        304981.62
11  100671.96        249744.55
13   91992.39        252664.93
16   78013.11        264346.06
20   76253.86        298664.47
25   64664.71        137962.62
32   63408.86         46085.25
34   46426.07        210797.67
37   44069.95        197029.42
39   38558.51        174999.30
40   28754.33        172795.67
42   23640.93        148001.11
44   22177.74         28334.72
47       0.00             0.00
49       0.00         45173.06

In [67]:
# 8
missing_values = df.isnull().sum()
print(missing_values)

R&D Spend          0
Administration     0
Marketing Spend    0
State              0
Profit             0
dtype: int64

In [68]:
# 9
df_filtered = df[df['Profit'] >= 50000]
print("\nDataset setelah menghapus data dengan profit di bawah 50000:")
df_filtered.head()

Dataset setelah menghapus data dengan profit di bawah 50000:

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [69]:
# 10
df_sorted = df.sort_values(by='Marketing Spend', ascending=False)
df_sorted.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

<h2> Data Cleaning

1. Import dataset berikut ke dalam dataframe.   
   dataset : https://raw.githubusercontent.com/michellechandraa/TutorDataMining/main/real_estate.csv
2. Tampilkan 10 data random dari dataset di atas
3. Cari informasi data dengan menggunakan fungsi describe
4. Hapus kolom 'No' dan ubahlah nama kolom dalam dataframe menjadi 'transaction date', 'house age', 'distance to the nearest MRT station', 'number of convinience stores', 'latitude', 'longitude', 'house price of unit area'
5. Cek apakah ada missing values dari masing-masing kolom

In [73]:
# 1
url = "https://raw.githubusercontent.com/michellechandraa/TutorDataMining/main/real_estate.csv"
df = pd.read_csv(url)
df.head()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
0,1,2012.917,32.0,84.87882,10,24.98298,121.54024,37.9
1,2,2012.917,19.5,306.59470,9,24.98034,121.53951,42.2
2,3,2013.583,13.3,561.98450,5,24.98746,121.54391,47.3
3,4,2013.500,13.3,561.98450,5,24.98746,121.54391,54.8
4,5,2012.833,5.0,390.56840,5,24.97937,121.54245,43.1

In [74]:
# 2
df.sample(10)

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
96,97,2013.417,6.4,90.45606,9,24.97433,121.54310,59.5
411,412,2013.250,18.8,390.96960,7,24.97923,121.53986,40.6
251,252,2012.917,31.7,1159.45400,0,24.94960,121.53018,13.8
289,290,2013.333,13.9,289.32480,5,24.98203,121.54348,44.5
355,356,2013.250,3.8,383.86240,5,24.98085,121.54391,60.7
293,294,2012.667,12.6,383.28050,7,24.96735,121.54464,42.5
43,44,2012.750,34.4,512.78710,6,24.98748,121.54301,34.1
212,213,2013.333,17.6,1805.66500,2,24.98672,121.52091,31.1
117,118,2013.000,13.6,4197.34900,0,24.93885,121.50383,13.0
361,362,2013.083,41.4,281.20500,8,24.97345,121.54093,63.3

In [75]:
# 3
df.describe()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
count,414.000000,414.000000,414.000000,414.000000,414.000000,414.000000,414.000000,414.000000
mean,207.500000,2013.148971,17.712560,1083.885689,4.094203,24.969030,121.533361,37.980193
std,119.655756,0.281967,11.392485,1262.109595,2.945562,0.012410,0.015347,13.606488
min,1.000000,2012.667000,0.000000,23.382840,0.000000,24.932070,121.473530,7.600000
25%,104.250000,2012.917000,9.025000,289.324800,1.000000,24.963000,121.528085,27.700000
50%,207.500000,2013.167000,16.100000,492.231300,4.000000,24.971100,121.538630,38.450000
75%,310.750000,2013.417000,28.150000,1454.279000,6.000000,24.977455,121.543305,46.600000
max,414.000000,2013.583000,43.800000,6488.021000,10.000000,25.014590,121.566270,117.500000

In [76]:
# 4
df_drop = df.drop(columns=['No'])
df_drop.columns = ['transaction date', 'house age', 'distance to the nearest MRT station', 'number of convenience stores', 'latitude', 'longitude', 'house price of unit area']
df_drop.head()

,transaction date,house age,distance to the nearest MRT station,number of convenience stores,latitude,longitude,house price of unit area
0,2012.917,32.0,84.87882,10,24.98298,121.54024,37.9
1,2012.917,19.5,306.59470,9,24.98034,121.53951,42.2
2,2013.583,13.3,561.98450,5,24.98746,121.54391,47.3
3,2013.500,13.3,561.98450,5,24.98746,121.54391,54.8
4,2012.833,5.0,390.56840,5,24.97937,121.54245,43.1

In [77]:
# 5
print(df_drop.isnull().sum())

transaction date                       0
house age                              0
distance to the nearest MRT station    0
number of convenience stores           0
latitude                               0
longitude                              0
house price of unit area               0
dtype: int64

## **Goodluck :)**